{"uid":"55ae28209657ba461e357514","pageIndex":1,"title":"Prism Senator Missing","date":"21 JUL 3301","url":"https://community.elitedangerous.com/galnet/uid/55ae28209657ba461e357514","content":"Prism Senator Missing\n\nIn the early hours of this morning, a security alert was received from the Imperial suite where Senator Kahina Tijani Loren has been residing.\nThe entry to the residence was found to be locked, and no response was received from inside. Security personnel were authorised to break in.\nThe interior of the suite was found to be pristine, with no evidence of habitation. In-room holofac consoles were found not to have been used throughout the duration of the Senator’s apparent occupation. A search has revealed no sign of the Senator’s whereabouts. \nAmbassador Cuthrick Delaney made a brief statement to the press. “Senator Kahina has previously empowered me to represent the Prism system on her behalf. I will do my best to discharge that duty according to her instructions. Senator Kahina is a very private individual, and has not sought my, or any other, counsel in the last month. We do not know where she has gone. Naturally we are concerned about her safety and would urge anyone who knows of her whereabouts to contact the authorities immediately. Her disappearance is very disturbing indeed.”\nReaction across the Empire was muted, but many have speculated that something underhand has happened to the visiting Senator. \n“Doesn’t matter what Delaney says,” said a commentator from the Imperial Citizen. “Prism belongs to Patreus now, Kahina’s just abandoned it and all the citizens she professed to care about. She’s a coward and an irrelevance.”\n“Did she get too close to the fires burning in the Empire?” asked Kazien Vantris, chief editor of the Imperial Herald. “Or is she pursuing some other objective? She was always determined and bold. Wherever you’ve gone, Lady Kahina, farewell.”\nLady Kahina’s Imperial Courier, the ‘Seven Veils’, still at the Capitol spaceport, was impounded and examined. It was found to be completely stripped of all valuable equipment, with the modifications made at Avalon shipyards discovered to be carefully crafted fakes.\nLady Kahina’s Imperial tiara was found in the cockpit, along with a small medallion bearing an ancient symbol on one side and the word ‘Salomé’ on the other.\nThe symbol is believed to belong to an organisation some refer to as ‘The Dark Wheel’.","extractionDate":"2021-03-22T02:53:11Z","deprecated":false}