{"uid":"56cdd9c09657bae3419aaddc","page_index":0,"title":"Galactic News: Technological Plague Continues to Threaten Starports","date":"24 FEB 3302","url":"https://community.elitedangerous.com/galnet/uid/56cdd9c09657bae3419aaddc","content":"It has been over a month since personnel at Obsidian Orbital reported that meta-alloys had been used to alleviate the starport's ongoing technical issues. Since then, there has been widespread speculation that the meta-alloys might hold the key to eradicating the technological plague that has blighted so many starports in recent months. But the only attempt to verify the theory was brought to an abrupt end with the mysterious disappearance of Professor Ishmael Palin, who had been researching the meta-alloys.\nA member of the technical team at Irens Dock in the Manite system, one of the latest starports to experience technical issues, commented on the situation:\n\"When I heard the news from Obsidian Orbital I expected people to start taking meta-alloys to the other affected starports, but that hasn't happened. Maybe people are being cautious - after all, we don't know for sure that the meta-alloys can help. But if you ask me, it's worth a shot.\"\nThe latest data on affected starports follows.\nStarports where services have been suspended:\nAckerman Market, Eravate\nvon Bellingshausen Port, Almar\nHaack Gateway, Halbangaay\nGabriel Enterprise, Harma\nGurragchaa Gateway, Warkushanui\nGaiman Dock, 49 Arietis\nWeyn Dock, 64 Arietis\nKorolyov Hub, Arawere\nLobachevsky Outpost, Pic Tok\nCarter Port, Rhea\nStarports experiencing technical issues:\nIrens Dock, Manite\nBloch Vision, Loperada\nSkvortsov Orbital, 63 G. Capricorni\nTall Enterprise, Ngalia\nLove Ring,  Evejitaka\nal-Din Prospect, Alpha Centauri\nRobigo Mines, Robigo\nSaunders's Dive, Wolf 1301\nAlexander Freeport, HIP 18843\nCoats Hub, Warkushanui\nBond Hub, Varati\nHinz Hub, Ngobe\nTsunenaga Dock, Iapodes\nLi Qing Jao, Sol\nRay Gateway, Diaguandri\nVizcaino Enterprise, Nganji\nTalos 2, Peregrina","extraction_date":"2021-03-22T02:01:02Z","deprecated":false}