{"uid":"59e723ce8d602d41747ba39c","page_index":0,"title":"Galactic News: Further INRA Bases Discovered","date":"19 OCT 3303","url":"https://community.elitedangerous.com/galnet/uid/59e723ce8d602d41747ba39c","content":"Further abandoned Intergalactic Naval Reserve Arm outposts have been discovered in systems throughout the core.\nRecords from the sites have shed additional light on the INRA’s activities, and indicate that the mycoid fungus, which was instrumental in countering the Thargoid incursions of the 3100s, was an unplanned by-product of the organisation’s research.\nThe records also indicate that the INRA tested the mycoid on living Thargoid specimens – a revelation that has already prompted censure from ethical groups.\nThe following text is taken directly from one of the INRA logs:\n“I know there are some who will condemn me for my part in this project. Let them. I harbour no remorse. The Thargoids understand only one thing: destruction. They will not stop until every last one of us has been reduced to dust. We have created a weapon that can prevent such a catastrophe. We have a moral obligation to use it.”\nOthers employed by the organisation, including the researcher whose work led to the development of the mycoid, took a different view:\n“To the public, the INRA is a symbol of all that is possible when superpowers set aside their differences and work together. Well, it might have started off like that, but it’s something very different now. Progress at any cost, might makes right – all our worst impulses channelled into an unaccountable organisation focused solely on making bigger and more powerful weapons.”\nResponse to the accounts has been mixed. Some commentators have suggested that the INRA’s actions were unethical, while others have opined that it took appropriate measures to defend humanity.\nNestor Cartesius, an Imperial Senator, said:\n“It is true that the INRA operated covertly, but there is nothing in the organisation’s past of which we need feel ashamed, and I see no reason for its work to remain secret. The INRA achieved the objectives it was created to fulfil – very successfully, I might add. The pertinent question is if its work can be of value to us now, in the wake of the Thargoids’ return.”","extraction_date":"2021-03-22T01:52:21Z","deprecated":false}