{"uid":"589db33015ac1c292f68b825","page_index":0,"title":"Galactic News: Intriguing Expedition Record Surfaces","date":"10 FEB 3303","url":"https://community.elitedangerous.com/galnet/uid/589db33015ac1c292f68b825","content":"A curious record has surfaced, detailing an apparently clandestine expedition to find relics from the lost civilisation known as the Guardians.\nThe record, which takes the form of a series of personal logs, indicates that the expedition was led by one Professor Melville, an authority on xeno-biology who disappeared a few months ago.\nThe record has attracted a considerable amount of attention, and is reprinted in full below.\n13th January 3303\n\"I'm not just going to sit here while that jumped-up mechanic Ram Tah spoon-feeds us information.\"\nThat's what Professor Melville said. He wanted to know more about the Guardians – maybe even figure out where they came from. So off we went, with little to go on beyond the professor's belief that there were more ruins out there.\nHe claims to have information that will help us find more sites, but he's keeping it close to his chest. Only he and the pilot know where we're going. It's like he's afraid someone will take credit for his discovery. We've been scanning lifeless planetoids for days, eyeballing the ground for locations.\nHe keeps reciting the same little speech: \"Xeno-achaeology has moved on. The days of exploring the outer reaches, only occasionally finding something of value, are behind us. I have found the key.\"\nBut I'm not an archaeologist. Professor Melville is just a means to an end. I signed up for the money.\n24th January 3303\nWe received an update today – apparently Ram Tah has found some new sites. Melville scoffed when he heard the news. \"Scraps from an amateur,\" he said. \"We'll find the real secrets. Trust me.\"\nTrust. That's an interesting thing. Why should we trust someone who doesn't trust us? Well, maybe he has reason not to: I took a look at his records while he was talking to the pilot. I don't like being kept in the dark.\nMelville thinks there could be hundreds of sites out there. His hypothesis is that the Guardians occupied an area of space similar in size to that currently inhabited by humans, but that for some reason they were forced to migrate. He believes he can find that region of space and the Guardians' point of origin.\nThe Guardians could well have had a huge civilisation, with hundreds of sites – maybe thousands – in this part of space. The similarities across different sites are comparable to the way we reuse certain structures. After all, how many Coriolis stations are there in the galaxy?\n2nd February 3303\nMelville thinks the Synuefe XR-H D11-102 system represents some kind of end point or 'last colony'. Beyond that, the sites appear in clusters, with the number of sites in each cluster getting increasingly larger. We discovered a cluster of sites only a few days ago before finding a location with an entirely unique layout. So far we've found three sites in each of the following systems: Synuefe LY-I b42-2, Synuefe NL-N c23-4 and Synuefe TP-F b44-0.\nThere are basically three different types of site, most of which have a different codex layout. Melville thinks that each type of site fulfilled a different function. He also thinks the Guardians were the dominant species in this region of space. But he's not content with this discovery. He wants to keep going.\nAre we ever going back to turn back?\n8th February 3303\nThis isn't a research vessel anymore – it's a prison. All means of communicating with the rest of the galaxy have been disabled. Melville has taken control of ship. His obsession has doomed us all.\nI'm transmitting these records in the hope that someone finds them and comes to our rescue. But the chances of that are slim.","extraction_date":"2021-03-22T02:36:27Z","deprecated":false}