{"uid":"5ab383f5b709787d505dd1a2","pageIndex":3,"title":"Thargoid Revelations","date":"23 MAR 3304","url":"https://community.elitedangerous.com/galnet/uid/5ab383f5b709787d505dd1a2","content":"Aegis has published a report containing significant insights into the Thargoids. The information was provided by the engineer Ram Tah, compiled from recently decrypted logs found at Guardian sites.\nKey extracts from the report are reprinted below:\n“The codices indicate that the Thargoids may be an older race than the Guardians, and that the two species share a history of conflict. This hostility was a product of the Thargoids’ belief that they had a pre-existing claim to the regions of space occupied by the Guardians.”\n“The Guardians attempted to communicate with the Thargoids, but these efforts ended in failure. They determined that the Thargoids’ survival instincts were so strong that they could not tolerate any potential threat, including the proximity of another space-faring civilisation.”\n“It is now clear that the Guardians’ defensive drones and advanced weaponry were developed principally to protect their worlds from the Thargoids. Although details are scant, it seems these war machines eventually succeeded in repelling the Thargoids.”\nProfessor Alba Tesreau, head of research at Aegis, publicly commented on the report: \n“Thanks to Ram Tah and the brave pilots who explored Guardian sites, some of our questions about the Thargoids have been answered. It is clear that our current situation echoes that of the Guardians. Our space, like theirs, was seeded with barnacles thousands of years ago, and now the Thargoids have arrived to reap the biomechanical harvest.”\n“We now know that the purpose of the Thargoids’ ongoing military offensive is to remove humanity from what they consider their territory. If the Thargoids adopt the same modus operandi as with the Guardians, their next move will be to start aggressively mining mineral resources. There is no evidence this has yet begun, however.”\nRam Tah has also made a statement about the impact of the findings:\n“Until now, the Thargoids have been shrouded in mystery, and their objectives have been unclear. For the first time, we have an insight into what drives them, why they are attacking us, and what their overall goals are. This is a historically significant discovery that I believe will make a huge difference to this conflict, and perhaps to humanity’s survival.”","extractionDate":"2021-03-22T02:37:12Z","deprecated":false}