{"uid":"5b23bca8cf6b0b7b1945efc7","page_index":0,"title":"Week in Review","date":"17 JUN 3304","url":"https://community.elitedangerous.com/galnet/uid/5b23bca8cf6b0b7b1945efc7","content":"Here are this week’s major stories.\nPrincess Aisling Duval’s anti-slavery campaign has merged with independent charity Universal Liberty. The rebranded organisation is named Unchain. The former head of Universal Liberty, Jarl Toredo, expressed his delight at the union, while rebuffing questions about his rumoured romantic attachment to Aisling Duval.\nLori Jameson has made a public statement regarding the League of Reparation, which claims to be seeking justice for her ancestor, Commander John Jameson. She denied any connection to the organisation while describing its actions as “misguided, unnecessary and evil”.\nMeanwhile, an independent journalist has suggested that the League of Reparation may be responsible for many more deaths than previously suspected, drawing a link between the terrorist organisation and various unsolved homicides. Chief Inspector Kay Kilbride of Alliance Interpol denied that the cold cases had any connection to the League of Reparation.\nA new academic article has drawn attention to a fringe religion that worships the Thargoids. The sect, which has no formal name, believes that the Thargoids are heralds of an omnipotent entity called the Far God. Dr Alfred Ulyanov, a leading expert in exotheology, has published an extensive commentary on the sect.\nIn other news, Senator Caspian Leopold has launched an initiative to construct a rehabilitation centre for those affected by heightened military action in the core systems. A spokesperson for Senator Leopold said: “An escalation in hostilities from both Thargoid and human parties has left a lot of innocent civilians without food or shelter. Senator Leopold has heard their cries for help, and is building a sanctuary where the safety of refugees can be guaranteed.”\nFinally, the competing campaigns from the Lave Radio Network and the Lave Jet Family have come to an end. Both factions received support from independent pilots, to whom generous rewards were promised, but ultimately there could be only one victor.\nAnd those are the main stories this week.","extraction_date":"2021-03-22T01:57:22Z","deprecated":false}