{"uid":"5b59e5ade14ab05c794ccfe4","page_index":0,"title":"League of Reparation Eliminated","date":"28 JUL 3304","url":"https://community.elitedangerous.com/galnet/uid/5b59e5ade14ab05c794ccfe4","content":"The League of Reparation has been dismantled, according to the tri-superpower taskforce investigating the organisation.\nCaptain Niamh Seutonia of the Imperial Internal Security Service made this statement:\n“Following the decryption of the League’s comms network, we have now arrested or eliminated every member of the organisation. The galactic community provided significant support by destroying the League’s strongholds in Federal and Imperial space. Thanks to their efforts, the League of Reparation has been defeated.”\nDeputy Inspector Mara Klatt spoke to the media about Riri McAllister, now known to be Nexus, the League’s central coordinator:\n“McAllister voluntarily revealed a surprising amount of information during questioning. It seems the League began building its forces a few years ago, recruiting misguided obsessives and mercenaries. They targeted INRA descendants to whom they could gain easy access, murdering dozens of innocent people.”\n“After Commander Jameson’s ship was discovered, the League started targeting high-profile individuals and leaving the 'For Jameson' message. This was designed to generate exposure and spread terror to families with an INRA connection.”\n“McAllister has confessed to being the original architect of the League. As for her motivation, she insists she is a direct descendant of Commander John Jameson, and that her duty was to avenge his death.”\n“In fact, McAllister is registered as an orphan of unknown lineage, meaning that we cannot verify her claim. Our suspicion is that this is a long-held delusion or a product of a psychological disorder.”\nAlliance Interpol later confirmed that McAllister had been charged with multiple terrorism-related crimes. Her trial will be held shortly.","extraction_date":"2021-03-22T02:18:53Z","deprecated":false}