{"uid":"5b7feed16813a1526c4258b2","pageIndex":0,"title":"Week in Review","date":"26 AUG 3304","url":"https://community.elitedangerous.com/galnet/uid/5b7feed16813a1526c4258b2","content":"Here are this week’s major stories.\nThe wedding of Princess Aisling Duval and Ambassador Jordan Rochester has been cancelled. The announcement follows anti-slavery campaigner Jarl Toredo’s confession that he and Aisling Duval were romantically involved for several months.\nMeanwhile, Lakon Spaceways has announced that a new ship, the Alliance Crusader, will go on general sale on Tuesday the 28th of August. The ship, which is based on the Alliance Chieftain, boasts three internal military compartments and a fighter bay.\nRival technology companies Supratech and Herculean Machines have released press statements promoting new personal-computer designs. Both companies have also confirmed they will be at the Rackham Ultratech Expo on Wednesday the 3rd of October, where they will reveal fully functional prototypes of their new devices.\nIn other news, the Federal Intelligence Agency has revealed that members of the Far God cult are disappearing in large numbers. While the FIA has speculated that adherents are abandoning the cult and attempting to return to normal life, there have been no reports of former Far God worshippers returning to their friends and families.\nAn exposé published by The Mars Tribune has revealed that Federal Congressman Morgan Unwin has close ties to a criminal organisation. Information uncovered by the Tribune proves that Unwin used his influence to traffic drugs for the Red Family cartel in order to keep his own addiction secret.\nRecent reports from the Betel system indicate that an ongoing feud between the Silver Creative Network and Betel Free has escalated into violence. With system security forces stretched thin, both organisations are seizing the opportunity to settle old grudges, and have issued calls for support.\nFinally, the Colonia Council has announced that its campaign to build a new hydroponics facility has been warmly received by the galactic community. Large quantities of material were delivered to Templar Barracks over the past week, allowing the initiative to move to the construction phase.\nAnd those are the main stories this week.","extractionDate":"2021-03-22T02:48:28Z","deprecated":false}