{"uid":"5b3e1bcc3ae0532c4b59a399","page_index":0,"title":"Week in Review","date":"08 JUL 3304","url":"https://community.elitedangerous.com/galnet/uid/5b3e1bcc3ae0532c4b59a399","content":"Here are this week’s major stories.\nA series of successful operations against the League of Reparation has led to much of the terrorist group being dismantled. But while the group has been dealt a severe blow, agents have yet to identify the organisation’s coordinator, Nexus.\nMeanwhile, an independent report suggests that a fringe Thargoid-worshipping cult may in fact be harbouring undercover Thargoid agents. A leading exotheologian responded by saying that he did not believe the group to be a threat, despite its unsettling beliefs.\nPolitical journalist Cassia Carvalho has compiled a profile on Jordan Rochester, fiancé of Princess Aisling Duval, for The Imperial Herald. The article documents Rochester’s family history, and raises the question of how he will balance being both a Federal statesman and an Imperial consort.\nIn other news, celebrated author Olav Redcourt has begun a promotional tour that will take him to over fifty destinations throughout the core systems. The tour will support Redcourt’s new novel, ‘Corsair King and the Storm of Desire’, the fourteenth in a series of swashbuckling historical romances set in the 27th century.\nDidiomanja Emperor's Grace has completed work on the Tiverion Academy, a flight school for Imperial naval cadets, and is hosting an inaugural banquet to mark the event. The organisation has placed an open order for exotic food and drinks, to be served at the celebratory banquet, and issued an appeal for mined resources, which will be used to construct a statue of Admiral Mira Tiverion.\nFinally, the campaign to supply a scientific project in Colonia has now concluded, and construction of a resource-management centre has begun. Hundreds of independent pilots made the journey to deliver commodities to Tir Technology Services in the Tir system.\nAnd those are the main stories this week.","extraction_date":"2021-03-22T01:56:46Z","deprecated":false}