{"uid":"5da730d918b1ea364c3cacfb","page_index":0,"title":"Initiative to Eradicate Rockforth Fertiliser","date":"16 OCT 3305","url":"https://community.elitedangerous.com/galnet/uid/5da730d918b1ea364c3cacfb","content":"The Rockforth Corporation’s EX7 fertiliser has been linked to the blight affecting crops in a number of systems, prompting an initiative to remove the product from the market. \nDr Genevieve Kane of the Interstellar Association for Agriculture delivered an urgent message:\n“Comparative analysis has confirmed that the blight is caused by the EX7 fertiliser. The original poor harvests have been attributed to natural factors, and it is now thought that the situation could have been contained had the fertiliser not exacerbated the problem.”\n“Initial food shortages were offset by a recent trade appeal in the Diso and Orerve systems, but the blight’s symptoms have since been reported in hundreds of systems. While we investigate the reasons for this rapid spread, preventing further fertiliser distribution is vital.”\nRockforth fertiliser can now be collected at zero cost from the following markets:\nSharon Lee Free Market, Orrere\nLave Station, Lave\nWarinus, Lave\nShifnalport, Diso\nDavies High, Reorte\nWatson Station, Orerve\nRoentgen Hub, LFT 37\nMacedo Station, Lei Zi\nPhillips Gateway, Ensoreus\nBaird Gateway, Arque\nLa Soeur du Dan Ham, Riedquat\nThe Teveri Progressive Party has arranged for the safe disposal of the fertiliser and has offered to compensate pilots for their efforts. The fertiliser should be delivered to Wiley Port in the Teveri system.\nTo expedite this initiative, Lakon Spaceways has agreed to lower the cost of the Type-6 Transporter, Type-7 Transporter and Type-9 Heavy. Cargo rack prices have also been reduced in all starports.\nThe initiative is scheduled to run from the 16th to the 22nd of October 3305. If the final target is met earlier than planned, the campaign will end immediately.","extraction_date":"2021-03-22T02:29:31Z","deprecated":false}