{"uid":"5ce6a5a7d2dd897c914babc9","page_index":0,"title":"Corporations Clash in Guardian Space","date":"23 MAY 3305","url":"https://community.elitedangerous.com/galnet/uid/5ce6a5a7d2dd897c914babc9","content":"A successful appeal by Zende Partners for Guardian commodities has led to the appointment of a technology broker at The Prospect, where Guardian modules are now available. The initiative has seen a marked increase in violence in the Synuefe EN-H d11-96 system, however, recently established as a hub of Guardian technological research.\nFreya Taine, CEO of Zende Partners, made this announcement:\n“Shortly after our company deployed a megaship transport service connecting Zende and Guardian space, our convoys came under attack. We have evidence to suggest that Segnen Exchange is responsible for this flagrant attempt to undermine our efforts.”\n“I call upon the galactic community to assist Zende Partners in removing this threat to our operation. Our plans to begin production of an Advanced Multi-cannon can proceed once Segnen Exchange’s disruptions have been dealt with.”\nCedrik Stone, CEO of Segnen Exchange, submitted this statement in response to the accusations:\n“Zende Partners apparently intends to control the trade of Guardian commodities in Synuefe EN-H d11-96, which is perhaps why there is violent resistance to their operation. My company would only ever respond to threats with an appropriate level of self-defence.”\n“In order to reestablish peace and protect our research into new Guardian-human technology, we ask independent pilots to support Segnen Exchange vessels in the system. Securing a permanent presence will allow my company to complete work on an Advanced Dumbfire Launcher on schedule.”\n“Our newly established outpost, Indigo Dock, will serve as our base of operations in these efforts.”\nThe two factions have set out campaigns in Synuefe EN-H d11-96, to take place between the 23rd and 29th of May 3305.","extraction_date":"2021-03-22T02:31:53Z","deprecated":false}