{"uid":"60549ee6523a1708b207c060","page_index":0,"title":"Galactic Mysteries: The NMLA","date":"19 MAR 3307","url":"https://community.elitedangerous.com/galnet/uid/60549ee6523a1708b207c060","content":"Private investigators Erik Gunnarson and Francesca Wolfe review the Neo-Marlinist Liberation Army.\nGunnarson: “We don’t usually get involved with political cases, but it’s hard to ignore the largest terrorist attack in history.”\n“The NMLA is a radical offshoot of Marlinism, a democratic movement named after the Republic of Achenar’s original ruler, Marlin Duval. Most are peaceful protester types, but Neo-Marlinists want to overthrow the government by permanently removing the Imperial Family.”\n“What nobody knows is how the NMLA went from minor troublemakers to interstellar terrorists. The starport bombings last September came from nowhere, and their assassins have killed many Imperial bigwigs including Prince Harold Duval.”\n“Smart money was on them being funded by Empire’s enemies, but now the NMLA treat the Alliance and Federation as equal targets. Hitting all three superpower capitals was a hugely symbolic gesture, and should have been impossible. How did they bypass security and plant explosives without detection? Who the hell are these people?”\n“Even Wallglass doesn’t have a clue. But we won’t stop searching.”\nWolfe: “Despite my enquiries – and some unauthorised snooping – there’s no trace of the rumoured NMLA bomb factory in LTT 1935. But it did once exist, because the Empire captured its occupants.”\n“Not that they’ll admit it. ‘There is no such place as Serene Harbour’, right? Well, I’ve been to R CrA Sector AF-A d42 3b and seen it myself. It’s bleak. Hope-crushing. And yet the NMLA prisoners listed as Theta Group escaped, broken out by what seems like Imperial Intelligence double-agents.”\n“That genuinely scares me. If the NMLA can worm inside the most shadowy security organisation in known space, they could be anywhere. And none of us are safe.”","extraction_date":"2021-03-22T02:16:31Z","deprecated":false}