{"uid":"636382fc087a4e084124ed98","pageIndex":0,"title":"Azimuth to Expand Operational Assets","date":"03 NOV 3308","url":"https://community.elitedangerous.com/galnet/uid/636382fc087a4e084124ed98","content":"Azimuth Biotech has announced a campaign in the Wandrama system to expand its military and surface facility capacity.\nThe controversial weapons developer has seen a recent downturn in fortunes, due to fierce opposition by independent pilots protesting Azimuth’s history of illicit research. The failure of Salvation to bring an end to the war has also soured public sentiment towards the corporation.\nAzimuth Biotech CEO Torben Rademaker announced the initiative:\n“After a period of reflection, it is time for Azimuth to once again step forward and assume a position of support for the brave pilots engaging Thargoid forces wherever they are encountered. To do this, we shall establish a new megaship equipped to operation in Thargoid-tainted systems. The tragic loss of the Bright Sentinel and Heart of Taurus in HIP 22460 must not hinder our ambition any further.”\n“We also intend to operate several surface outposts to aid our research projects. We aim to contribute to humanity’s military options once again, being careful not to repeat the mistakes of our former figurehead.”\nPilots contributing to Azimuth’s campaign, hosted at the Musashi megaship in Wandrama, will be granted the Mbooni permit and access to the company’s range of anti-xeno weaponry. Rademaker has promised that a successful campaign will allow for the Glorious Prospect to offer the Mbooni permit from the T-Tauri system permanently.\nWithin hours of the announcement, opponents of Azimuth Biotech had organised a counter-campaign to prevent deliveries from reaching Wandrama. Combat between Azimuth security forces and anti-Azimuth activists has been reported in the system. It is believed efforts to derail the campaign are being directed from MacLean City by Wandrama Purple Council. \nIn an effort to rally combat pilots to their respective causes, both factions are offering module rewards. Azimuth Biotech is offering its overcharged Guardian plasma charger, while Wandrama Purple Council promises a rapid-fire multi-cannon with phasing sequence.","extractionDate":"2022-12-01T01:14:31Z","deprecated":false}