{"uid":"63907ac54200096acd748522","pageIndex":0,"title":"Carnage Wrought by Further Maelstroms","date":"08 DEC 3308","url":"https://community.elitedangerous.com/galnet/uid/63907ac54200096acd748522","content":"*Pilots’ Federation ALERT*\nThe rogue signal sources Cocijo and Oya have arrived at their estimated destinations.\nTheir impact mirrored that of the Taranis, Indra and Leigong Maelstroms. A total of 16 neighbouring systems were immediately overwhelmed by Thargoid fleets, which launched devastating bombardments against orbital starports and planetary infrastructure. \nOther inhabited systems in the vicinity are resisting occupation. Superpower capital ships and independent pilots are currently battling to protect the local populations.\nFive rogue signal sources have now manifested as Maelstroms, with three more approaching at faster-than-light speed. Many systems have completely fallen to the Thargoids in the vicinity of each Maelstrom. Safeguard Interstellar reported that millions of refugees are threatening to overwhelm emergency services and rescue teams. Military forces are also struggling to contain the enormous numbers of Thargoid vessels.\nProfessor Alba Tesreau is one of many xenologists and other specialists trying to learn more about the mysterious Maelstroms. She gave a brief update to Vox Galactica:\n“Full-scale war with the Thargoids has always been my greatest fear. It is now a reality. It’s more crucial than ever that we obtain an understanding of this species, particularly these powerful new entities deployed against humanity.”\n“Seo Jin-ae, who possesses a base comprehension of Thargoid intent via her neural implants, believes these are focused, systematic strikes rather than a frenzied assault. She feels that the Thargoids are working toward a specific goal, but cannot yet identify its nature.”\n“The one advantage given to us by the arrival of further Maelstroms is the potential that Thargoid forces will be distributed more evenly across systems. With an expanded front line, defensive efforts may gain additional traction when defending or recapturing systems from the aliens.”\nIn related news, Azimuth Biotech’s new anti-xeno megaship has entered service in the T Tauri system. Eternal Vigilance was commissioned following an initiative in November, which was challenged by a counter-campaign aiming to prevent the corporation’s resurgence.","extractionDate":"2023-02-27T19:54:33Z","deprecated":false}