{"uid":"62f39215afa2a01c0c5ef827","pageIndex":0,"title":"Thargoids Conquer HIP 22460","date":"10 AUG 3308","url":"https://community.elitedangerous.com/galnet/uid/62f39215afa2a01c0c5ef827","content":"*Pilots’ Federation ALERT*\nThe Proteus Wave’s failure has resulted in Thargoid forces overwhelming the coalition fleet in HIP 22460.\nIndependent and military observers have confirmed that although Salvation’s anti-xeno superweapon was activated as scheduled, it had only a temporary effect on the Thargoids. Soon afterwards, human ships in the system found themselves without power following a second unknown energy pulse and were rapidly targeted by hostile Thargoid vessels.\nVox Galactica announced that the reporter Jade Sanderlyn was able to jettison her escape pod before her drifting craft was destroyed. She delivered this summary:\n“It didn’t work. The Proteus Wave didn’t work. I saw its energies ripple out from the planet, I felt it, we all did. The Thargoids reeled and went dark, but only briefly. Then something else occurred, a noise which shook our bodies, screeching through our skulls. Something alien.”\n“Suddenly all systems went down: engines, comms, everything. All the flashing beams of capital ship weapons fire disappeared. Every human ship in our vicinity went dead, leaving us floating through space.”\n“I watched through the canopy as the Thargoids swarmed everywhere, more than I’d ever seen before. The Bright Sentinel was their first target, and they unleashed a blazing barrage against it. Nobody on board could have survived.”\nThe superpowers have announced that HIP 22460 is off-limits to civilian traffic, and should now be considered Thargoid territory. The Alliance Defence Force, Federal Navy and Imperial Navy have each begun compiling official lists of every military ship deployed to the system which remains unaccounted for.\nAzimuth Biotech likewise issued a statement confirming that both the Bright Sentinel and Heart of Taurus megaships have been destroyed, with all Proteus Wave project engineers missing and presumed dead. No information on the status of Salvation has yet been offered by the corporation.","extractionDate":"2022-12-01T01:21:20Z","deprecated":false}