{"uid":"62bee58992991d27d974cde3","pageIndex":0,"title":"Leaders Respond to Azimuth Initiative","date":"01 JUL 3308","url":"https://community.elitedangerous.com/galnet/uid/62bee58992991d27d974cde3","content":"The anti-xeno operation in HIP 22460 involving Azimuth Biotech and the superpowers has drawn comments from prominent political figures.\nEmperor Arissa Lavigny-Duval: “I agree with Senator Patreus that supporting Azimuth’s proposal remains our most practical course of action. However, alternative options for tackling the Thargoid threat are required.”\nPrincess Aisling Duval: “Salvation is clearly a master of self-promotion and public manipulation. I only hope that the Empire does not regret associating with this distasteful individual.”\nPrime Minister Edmund Mahon: “Our military presence in HIP 22460, coupled with the strategic defence pact with Sirius Corporation, shows that the long-term security of Allied systems remains our priority.”\nCouncillor Nakato Kaine: “Two ruthless corporations with disreputable histories, and the Alliance is now collaborating with both. This a deeply regrettable chapter in our history.”\nPresident Zachary Hudson: “I have every confidence in the Federal Navy to protect Salvation while the Proteus Wave is prepared. This is a long-overdue reprisal against an intractable and relentless enemy.”\nShadow President Felicia Winters: “Azimuth’s superweapon is effective, I’ll admit. But I’m unhappy with relying on this clandestine organisation, rather than an accountable anti-xeno agency.”\nCEO Li Yong-Rui: “Sirius Corporation is observing activities in HIP 22460 with great interest. I am keen to explore cooperation with Azimuth Biotech on developing new products using Proteus Wave technology.”\nSimguru Pranav Antal: “The advanced electromagnetic sciences developed by the Guardians over a million years ago remain poorly understood, even to Utopia’s keenest minds. The safety and effectiveness of Salvation’s device cannot be guaranteed.”","extractionDate":"2022-12-01T01:11:30Z","deprecated":false}