{"uid":"622a01812d6be116787efaf9","pageIndex":0,"title":"Colonia Bridge Reaches Completion","date":"10 MAR 3308","url":"https://community.elitedangerous.com/galnet/uid/622a01812d6be116787efaf9","content":"*Pilots’ Federation ALERT*\nBrewer Corporation’s project to improve travel between the core systems and Colonia region has successfully concluded.\nThe final batch of service installations wraps up construction work on the six starports. The following services will be available at Canonn Complex, Helgrind Gateway, Venatores Hub, Vladmir McDoogle's Triumph and Zerreiss Station:\nUniversal Cartographics \\ Vista Genomics\nPioneer Supplies \\ Bartender\nCrew Lounge \\ Search and Rescue\nMaterial Trader \\ Human Tech Broker\nOutfitting \\ Shipyard\nThe following services will be available at Promium Relay:\nUniversal Cartographics \\ Vista Genomics\nPioneer Supplies \\ Bartender\nMaterial Trader \\ Human Tech Broker\nOutfitting \\ Shipyard\nMaterial traders of all types will be represented across the starports.\nNewsfeeds were expecting one final press release from Brewer Corporation, but instead received a rare personal message from the company’s CEO Madelyn Teague:\n“It gives me enormous pleasure to announce a triumphant end for this historic undertaking. I want to thank every single person whose hard work made this dream of mine a reality. The names of those pilots most dedicated to the project will soon be recorded on commemorative beacons in the Alcor and Colonia systems.”\n“All of us at Brewer Corporation feel a real sense of pride in the Colonia Bridge. For decades to come, these six starports and 56 megaships will boost trade, support exploration and serve as way-stations for travellers. They represent what can be achieved when so many of us share the same vision and work together in harmony.”\nPilots who delivered materials can now collect payment from Macdonald Settlement in the Alcor system and Jaques Station in the Colonia system. The top 75% of contributors for the past week can also collect their pre-engineered overcharged power plant modules on the 11th of March.","extractionDate":"2022-12-01T01:14:39Z","deprecated":false}