{"uid":"6308ad755793041ef01f6b22","pageIndex":0,"title":"Retrial Requested for Admiral Tanner","date":"26 AUG 3308","url":"https://community.elitedangerous.com/galnet/uid/6308ad755793041ef01f6b22","content":"The Federal Attorney’s Office has called for the conviction of former admiral Aden Tanner to be reviewed in light of events in HIP 22460.\nFollowing a distinguished career in the Federal Navy, Tanner served as the chief military liaison for Aegis. In November 3307, while in command of the Aegis Defense megaship Musashi, he attempted to take control of Hind Mine starport. He believed it held evidence that Salvation intentionally attracted the Thargoids to the Cornsar system in order to test his superweapon.\nTanner’s attack failed and the Musashi was overtaken, largely due to superior numbers of independent pilots supporting the former Taurus Mining Ventures, now Azimuth Biotech. He was court martialled, dishonourably discharged, and found guilty of mutiny and unlawful military action. But his sentencing was postponed by request of Fleet Admiral Tayo Maikori, who considered Tanner’s intel to be crucial to his own investigation into Salvation.\nThe Federal Times published this statement from Senior Attorney Fiona Logan:\n“It is now a proven fact that the Guardian-based nature of the Proteus Wave was intended to attract the Thargoid fleet to HIP 22460. Component analysis by Ram Tah has verified that its forerunner superweapons were almost certainly designed to do likewise.”\n“This substantiates Tanner’s allegation that Salvation deliberately invited Thargoid incursions in inhabited systems. Furthermore, Salvation originally claimed that his anti-xeno detection network alerted him to the aliens’ approach, but there is no evidence that this network exists.”\nThe Federal Navy Criminal Court confirmed that a formal application for a judiciary review was received. A special panel has been convened to reassess Tanner’s case.","extractionDate":"2022-12-01T01:21:00Z","deprecated":false}