{"uid":"649d57441d711e64706c7cda","pageIndex":0,"title":"Imperial Mother in Medical Emergency","date":"03 JUL 3309","url":"https://community.elitedangerous.com/galnet/uid/649d57441d711e64706c7cda","content":"Lady Florence Lavigny, the mother of Emperor Arissa Lavigny-Duval, has been placed under medical supervision following a sudden illness.\nAn official statement was released by the Imperial Palace:\n“The Imperial Mother, Lady Florence Lavigny, has suffered an unexpected medical emergency. She is being cared for by a specialist team at her Lake Parisot estate on the planet Topaz . Details of her illness are not being shared at this time.”\n“Her Majesty the Emperor has cancelled all appointments and travelled to be at her mother’s side. The latest report states that Lady Lavigny has undergone surgical treatment and is in a poor but stable condition. We know that all citizens will join us in wishing the best for this prominent member of the Imperial Family.”\nRoyal correspondent Gudrun Vestergaard provided some background to the story:\n“The Duvals always ensure that each Emperor’s parents are afforded the greatest respect, not to mention the finest medical care. Although the Imperial Mother’s ailment remains unspecified, not many fear it to be fatal at this early stage.”\n“Though Lady Lavigny’s engagement to the late Emperor Hengist Duval brought the highest of profiles, she has typically sought to avoid the spotlight. Despite this, she has repeatedly been in the eye of a media storm. In 3250, her husband Prince Aristide de Lavigny met with a mysterious accident that was never fully explained. Decades later, it was revealed that their daughter Arissa had been sired by Emperor Hengist. Upon being selected by the Senate in 3301, Arissa adopted the new surname of Lavigny-Duval to reflect her previously unknown royal heritage.”\n“Princess Aisling Duval, Archduke Otto Lombardo-Duval, Countess Guinevere Lavigny and many other Imperial Family members have all sent their hopes for a rapid recovery. A similar message came from Hadrian Augustus Duval, in an apparent attempt to rebuild bridges after his recent public spat with the Emperor. As the descendant of another of Hengist’s affairs, perhaps Hadrian feels more of a kinship with Florence Lavigny than most others in the Duval dynasty.”","extractionDate":"2023-10-28T19:27:40Z","deprecated":false}