{"uid":"644024ce2611793fb45154c4","pageIndex":0,"title":"The Mystery of the Mars Assassin","date":"25 APR 3309","url":"https://community.elitedangerous.com/galnet/uid/644024ce2611793fb45154c4","content":"The suspected ‘Imperial assassin’ who shot Caine-Massey CEO Johann Fleischer has been cleared of any connection to the Empire.\nExecutive Agent Viola Trask of the Federal Intelligence Agency gave a statement to the media:\n“Our investigation has verified that the man we have in custody is a professional mercenary named Kieran Rayne , a native of the Alpha Caeli system. For over a decade, he has operated as a freelance contract killer using multiple false identities. The motive for the killing is not yet clear.”\n“Despite early indications, there is no evidence that Rayne was hired by Torval Mining Ltd to eliminate Mr Fleischer. The mission was arranged anonymously via an unregistered comms network that we are unable to access. The Imperial-issue weapon and security equipment that he used were provided to him specifically for this task. This seems to be a deliberate choice to foster the impression that the assassination was ordered by elements within the Empire.”\n“It has not gone unnoticed that the evidence implicating an Imperial Intelligence agent was ‘too good to be true’. I’d like to stress that the FIA was fully aware of this possibility. It is unfortunate that Caine-Massey executives deployed their security forces in Tavgi before our investigation was complete.”\nCongress has accepted the report and stated that no further action will be taken. It is expected that once the FIA’s questioning is complete, Rayne will face a life sentence in a maximum-security prison.\nPhilippa Barlow-Lyons, the new CEO of Caine-Massey, addressed this development during an address to the corporation’s employees:\n“I know that nobody can ever replace Johann, who meant so much to us all. In his memory, I aim to run things exactly as he would have wanted. We have no choice but to accept the results of the investigation and formally withdraw our accusation against Zemina Torval and her family. I concede that grief may have gotten the better of me in recent days. But in my heart, I know that one day the truth will be laid bare, and the guilty will face Federal justice.”","extractionDate":"2023-06-23T20:13:12Z","deprecated":false}