{"uid":"652571e3682552d48b0a2eff","pageIndex":0,"title":"Federal Election: The Allied Perspective","date":"13 OCT 3309","url":"https://community.elitedangerous.com/galnet/uid/652571e3682552d48b0a2eff","content":"The Alliance is observing the Federal president election, but expects little will change in relationships between the two superpowers.\nPrime Minister Edmund Mahon delivered a formal address on the topic before the Assembly:\n“The Alliance continues to enjoy stable relations with the Federation. Our recent anti-xeno coalitions, including the reformation of Aegis, show how we can benefit from maintaining such cooperation. I am confident that the new president, whoever it may be, will respect the status quo.”\nCouncillor Nakato Kaine gave a more direct statement to the press:\n“I cannot ignore how the Federation has become more authoritarian under Zachary Hudson’s Republican government. It has also coped poorly with internal pressures: the Starship One conspiracy, Jupiter Division’s attempted coup, the secession crisis triggered by the Proactive Detection Bureau’s operation… the list goes on. And yet, Federal democracy is now empowering every individual to elect their leaders. That, at least, is something we in the Alliance should admire and consider adopting.”\nVanya Driscoll, political correspondent for The Alliance Tribune, reported:\n“Most Allied politicians are too diplomatic to openly express a preference between the two candidates. Privately, councillors like Kaine are hopeful of a more nuanced relationship with Winters, who lacks the hawkish rhetoric of Hudson. However, others believe that Archer’s focus on military spending and domestic security might prove more practical in the face of the Thargoid invasion.”\nThe latest voting polls from Federal systems show that Jerome Archer has overtaken Felicia Winters, albeit by a narrow margin. The voting window ends on the 15th, with the results verified by Monday to determine the victor of the 3309 Federal presidential election.","extractionDate":"2023-10-28T19:27:48Z","deprecated":false}