{"uid":"64c143d7378dd1302e21a9d2","pageIndex":0,"title":"Dedicant Quest Yields Results","date":"27 JUL 3309","url":"https://community.elitedangerous.com/galnet/uid/64c143d7378dd1302e21a9d2","content":"*Pilots’ Federation ALERT*\nThe missing megaship Dedicant is close to being located after fragments of its distress call were tracked down.\nThe scrambled messages were discovered on comms beacons in the LP 714-58, Wuniez, Olurung and Kwakimo systems. Combined decryption efforts eventually led to another beacon in the HIP 19912 system, where the Dedicant’s original transmission was revealed:\nFEDERAL ESCORT TEAM ALPHA\nASSIGNED TO ORDER OF THE FAR GOD MEGASHIP ‘DEDICANT’\nPRISONER TRANSFER MISSION HAS FAILED\nSIGNIFICANT NON-LETHAL DEFENSIVE MEASURES ENCOUNTERED\nMAJORITY OF ORDER OF THE FAR GOD PRISONERS ESCAPED\nPRISONERS INITIATED DEDICANT HYPERDRIVE\nESCORT TEAMS ALPHA, BRAVO, CHARLIE AND CULTISTS REMAIN ON BOARD\n‘DEDICANT’ CURRENT LOCATION UNKNOWN\nADVISE TRACING METADATA COORDINATES TO THIS MESSAGE\nREQUEST IMMEDIATE FEDERAL NAVY ASSISTANCE\nVice Admiral Amir Rafiq of the Imperial Navy provided an update:\n“Imperial Intelligence specialists are currently analysing the comms beacon in HIP 19912 to trace the message to its point of origin.   We have orders not to commence any joint operations with the Federation, but I am authorised to make our findings public.”\nExecutive Agent Jalen Locke of the Federal Intelligence Agency told the media:\n“We appreciate the assistance from the Empire  , and from all the independent pilots who helped find this distress call. It has confirmed our theory that the prisoners managed to regain control of their former vessel, using various modifications made to its internal systems.”\n“FIA security teams are standing by to launch a rescue mission as and when the Dedicant’s location is pinpointed. They will retake the megaship by force if necessary and detain   all Far God cultists onboard.”","extractionDate":"2023-10-28T19:26:56Z","deprecated":false}