{"uid":"63ee03268938e9055f44c707","pageIndex":0,"title":"Princess Aisling ‘Understood Risk of Speaking Out’","date":"17 FEB 3309","url":"https://community.elitedangerous.com/galnet/uid/63ee03268938e9055f44c707","content":"Princess Aisling Duval has assumed oversight of the Empire’s contributions to the tri-superpower agency Aegis.\nShe discussed her new role during an interview with The Imperial Herald:\n“Loathe though I was to defy the Emperor’s decree, every instinct told me that the Aegis initiative can develop methods of protecting the Empire from enormous losses in this war. I’m grateful that Arissa recognised the value of my plea.”\n“I’ve been liaising with Professor Alba Tesreau, as well as Dr Fonseca, Vice Admiral Anderson and the rest of my team. Our challenge is to make the most of the Imperial resources allocated to Aegis.”\n“It’s true that I was critical of Aegis’s effectiveness in the past, but I’ve always believed that cooperation with other superpowers can bring mutual benefits. The mass slaughter inflicted by the Thargoids eclipses the NMLA’s atrocities – a challenge we faced together. We must trust each other now as we did then.”\nThe newsfeed also featured a response from Hadrian Augustus Duval:\n“It’s gratifying to see that Patreus and Torval aren’t as influential as they think they are. Yet that doesn’t mean Aisling is right. The Empire must not chain itself to the Alliance and Federation once again. The Emperor can be ruthless when it suits her, as I know only too well, but in this case she lacks the courage of her convictions.”\nRoyal correspondent Gudrun Vestergaard observed:\n“This is a calculated move by Emperor Arissa Lavigny-Duval. If Aegis fails, her isolationist policy will be vindicated. If Aegis succeeds, she can claim credit for permitting this exception. The risk is whether the public would credit an Aegis-assisted victory over the Thargoids to the Princess. Such an outcome would increase Aisling’s popularity and political capital to a level Arissa is unlikely to tolerate for long.”","extractionDate":"2023-02-27T19:53:51Z","deprecated":false}