{"uid":"652fe5df2ccd9c8ca302fae7","pageIndex":0,"title":"Winters Outlines Her Future Presidency","date":"19 OCT 3309","url":"https://community.elitedangerous.com/galnet/uid/652fe5df2ccd9c8ca302fae7","content":"President-elect Felicia Winters has discussed her election victory and other topics during an interview with The Federal Times.\nOn defeating Vice President Jerome Archer:\n“One cannot dispute that Archer played his campaign straight, with none of the underhanded tricks utilised by some of his predecessors. But the election results prove that the citizens want a change from the Republican Party’s bombastic approach.”\nOn the priorities for her forthcoming administration:\n“Our government will expand investment in the Federation’s soft infrastructure, pulling the economy’s focus away from military projects and corporate profits. Many systems are in dire need of improved healthcare, housing and work opportunities. Billions of people need temporary financial support as refugees from the Thargoid invasion. We are not the Empire – we serve our people rather than rule over them.”\nOn the Proactive Detection Bureau:\n“My very first task in office will be to dismantle this monstrosity, ending the surveillance of private communications. The Federal Intelligence Agency is perfectly capable of protecting our people without violating their personal freedoms.”\nOn the Thargoid war:\n“I can assure everyone that while I lack the enthusiasm for war that my predecessor demonstrated, my administration takes office with the Thargoid invasion as a top priority. Aegis has led the way in developing new anti-xeno technologies, and Federal support for the agency will continue.”\nMany Federal newsfeeds congratulated Felicia Winters on her success in the election, but an editorial in Sol Today said:\n“Without Zachary Hudson’s strength of will, or Jerome Archer’s dedication to security, there’s every possibility that the Federation will rot from within. You can expect to see all manner of fringe groups and minorities grab the lion’s share of funding, while freeloaders and criminals get a free pass. We predict that Winters will go down in history as one of the weakest presidents ever.”","extractionDate":"2023-10-28T19:27:24Z","deprecated":false}