{"uid":"6464d7f018d19772757f2629","pageIndex":0,"title":"Thargoid ‘Hunter’ Vessel Class Confirmed","date":"18 MAY 3309","url":"https://community.elitedangerous.com/galnet/uid/6464d7f018d19772757f2629","content":"*Pilots’ Federation ALERT*\nA new type of Thargoid vessel, first encountered within the Maelstroms, is interdicting ships in Thargoid controlled systems.\nAegis highlighted the threat as part of its research into the Thargoid capital ships. Commodore Emil Varga, the Allied military liaison, gave this statement:\n“The first explorers to breach the Maelstroms’ inner regions encountered a previously unseen Thargoid vessel, larger than a scout but smaller than an interceptor. These medium-sized craft have been categorised as hunters, with this specific class designated the ‘Glaive’ due to its blade-like protrusions.”\n“The Glaives operated close to the motherships, so it was initially believed they acted as sentries. But in recent days they have appeared within systems under Thargoid control. Pilots lucky enough to survive these encounters report being forced out of supercruise by Glaives and aggressively attacked.”\n“Personally, I believe that our newfound ability to penetrate the Maelstroms caught the Thargoids by surprise. In response, they have redeployed the mothership’s defenders to a more offensive role. Such rapid tactical adaptation is not typical of this species, which is a good indicator that we have them worried.”\nAden Tanner provided more details following a research mission:\n“The Glaive is extremely aggressive and attacks any human ship within range. Its high-intensity energy weapons take the form of lightning bolts, similar to a Thargoid interceptor, but this vessel is faster and more manoeuvrable.”\n“Anti-xeno pilots should be advised that Glaives are also capable of disabling Guardian-based weaponry. This only became apparent when encountering them outside of the Maelstrom systems, where the Thargoids’ anti-Guardian field is permanently present.”","extractionDate":"2023-06-23T20:12:17Z","deprecated":false}