{"uid":"63a19be07fdcb32979196012","pageIndex":0,"title":"Azimuth Conducts AX Weapons Research","date":"03 JAN 3309","url":"https://community.elitedangerous.com/galnet/uid/63a19be07fdcb32979196012","content":"The corporation Azimuth Biotech has outlined its plans to support the war effort against the Thargoids by improving ship anti-xeno firepower.\nCEO Torben Rademaker was interviewed on The Tau Ceti Journal’s official ICE-cast, where he explained:\n“As you may recall, one of the many reasons Aegis became redundant was its poor record in improving AX armaments past the initial rush of designs. Azimuth Biotech has established a research and development division specifically designed to correct their failings at a steady, sustainable pace.”\n“One of the inherent limitations with Aegis’s designs is the maximum number of AX weapons that a ship can be outfitted with. The enhanced versions based on Ryder and Nemo’s designs share this limitation. We seek to increase the upper limit of AX weapons a ship can utilise, and our research teams are already reporting promising results.”\nOne of the ICE-cast’s interactive audience questions asked why Azimuth was not working with Proteus Wave technology to build more anti-xeno superweapons. Rademaker replied:\n“Under my guidance, the corporation has moved away from Salvation’s esoteric field of research and adopted a more conventional direction. It seems clear to me that the superweapon project led by my predecessor was, ultimately, a failure.”\nRademaker also answered an accusation that Azimuth was responsible for the loss of life in HIP 22460, and that he should face trial for ‘causing the Thargoid Maelstroms’:\n“Sadly, I often come across such simplistic blame-seeking from those with limited comprehension of the issue. The plain fact is that nobody could have predicted the Thargoids’ excessive reaction to our activities in HIP 22460. The Proteus Wave was deemed an acceptable means of ending the war, approved by individuals with far more military experience than Salvation could claim.”\nRademaker’s only response to a subsequent barrage of abuse from a member of Operation Wych-Hunt was less verbose. The interview feed was terminated.","extractionDate":"2023-02-27T19:53:56Z","deprecated":false}