{"uid":"642d7b00adc2a737d8340de3","pageIndex":0,"title":"Corporate Battle Erupts in Tavgi System","date":"06 APR 3309","url":"https://community.elitedangerous.com/galnet/uid/642d7b00adc2a737d8340de3","content":"*Pilots’ Federation ALERT*\nThe killing of Caine-Massey’s CEO has sparked conflict between the Federal corporation and Imperial rival Torval Mining Ltd.\nActing CEO Philippa Barlow-Lyons provided a statement regarding the hostilities:\n“The Federal Intelligence Agency tracked Johann Fleischer’s assassin from Mars to the Tavgi system, whereupon he boarded the Orchestral Falcon, one of Torval Mining’s megaships. We demanded that he be handed over to stand trial for his crime. They refused to even acknowledge us. Zemina Torval thinks she has taken her revenge and got away with it. She is wrong.” \n“Caine-Massey has instructed Tavgi Blue Life Inc, our business partner in the system, to board the Orchestral Falcon – by force, if necessary – and apprehend the suspect. We will do whatever it takes to arrest the Imperial Intelligence agent we hold responsible for murdering a captain of Federal industry.”\nA response was issued by Senator Zemina Torval:\n“Caine-Massey is using its CEO’s death to excuse a deliberate strike against my company, damaging our share price and testing the will of our political connections. Torval Mining Ltd will defend its property, as well as the honour of the Empire, against this unjustified assault.”\nTo support their combat operations, Tavgi Blue Life Inc and Torval Mining Ltd have called upon Federal and Imperial naval auxiliaries to report to Gordon Enterprise and the Orchestral Falcon respectively. \nThe conflict has heightened political tensions between the Empire and the Federation. With the majority of superpower naval forces deployed to the Thargoid front line, system authority vessels around Tavgi have been placed on alert. \nPresident Zachary Hudson was quick to comment that “my administration upholds the right for our factions to seek justice”. Senator Denton Patreus stated: “The Empire stands ready to shield its citizens, businesses and territories from attacks by foreign powers, xeno or otherwise.”","extractionDate":"2023-06-23T20:12:07Z","deprecated":false}