{"uid":"649d5744aed4de43fc0d1f3a","pageIndex":0,"title":"Thargoid War Update: June 3309","date":"30 JUN 3309","url":"https://community.elitedangerous.com/galnet/uid/649d5744aed4de43fc0d1f3a","content":"The latest report on the ongoing struggle against the Thargoids from Vox Galactica reporter Jade Sanderlyn.\n“As the war reaches its eighth month, Thargoid invasion forces occupy over a thousand systems. Billions of people have been evacuated or lost as a result. Although this ongoing conflict has made little impact on everyday life for the other side of the bubble, it continues to dominate the media.”\n“The beginning of June saw the release of Aegis’s latest development: the pulse wave xeno scanner. This module allows any pilots who dares approach the Titans to gather much-needed data, triggering what The Empirical referred to as a ‘scientific gold rush’. We are a long way from fully comprehending the purpose of these gargantuan constructs, but the tools to do so are at least beginning to arrive.”\n“Unsurprisingly, Azimuth Biotech also declared its interest in the Titans. This led to the corporation competing indirectly with Aegis to collect tissue samples directly from the hull of the Thargoid motherships. Although there was significantly greater support for the tri-superpower agency - no doubt an encouraging sign for Aegis’s Professor Tesreau - Azimuth’s results suggest that some retain faith in Salvation’s legacy.”\n“On the subject of faith, another media talking point was the recent mysterious disappearance of the Dedicant. This Order of the Far God megaship, impounded for months by the FIA, was scheduled to deport tens of thousands of imprisoned adherents from the Federation to the Alliance. But with only a few thousand on board, the ship made a sudden hyperspace jump out of Popontia. Theories abound as to its fate, ranging from a simple engine malfunction to the Far God rescuing its loyal worshippers. Even in wartime, it seems everyone loves a mystery.”\n“On the front lines, of course, there is no time for such distractions. Thargoid Glaives hunt down human ships. Revenants seek to eliminate human trespassers on conquered worlds. Titans launch wave after wave of Thargoid vessels further into the core systems. Here, the focus remains locked onto the deadliest adversary we have ever faced. But the resistance is holding fast, and some traction is being made by anti-xeno forces. Systems are being recovered from alien control. There is hope that the tide is slowly turning.”\n“This is Jade Sanderlyn for Vox Galactica. Stay safe out there.”","extractionDate":"2023-10-28T19:27:29Z","deprecated":false}