{"uid":"63f7389f29c25456a22586b9","pageIndex":0,"title":"Aegis Launches Caustic Sink Launcher Initiative","date":"23 FEB 3309","url":"https://community.elitedangerous.com/galnet/uid/63f7389f29c25456a22586b9","content":"*Pilots’ Federation ALERT*\nDeliveries are requested in Duamta to fast-track production of a module that protects ships in caustic environments.\nProfessor Alba Tesreau, the head of Aegis, provided these details:\n“We are grateful to Aden Tanner for personally testing our prototype caustic sink launcher. The electrochemical reaction within the Maelstrom cloud was successfully channelled into semi-liquid anodes for ejection. This kept the ship hull intact for considerably longer before Tanner was forced to withdraw.”\n“Aegis is setting up manufacturing and distribution centres to make the caustic sink launcher widely available. The Alliance, Empire and Federation will all contribute, but we know that the process can be accelerated with the direct support of the galactic community.”\n“Therefore, we have an open order for shipments of advanced catalysers, heatsink interlinks and palladium. We also require caustic tissue samples obtained from the caustic generators that can be found inside the Maelstrom clouds. I urge pilots to exercise caution as these are highly dangerous to obtain, but crucial to the modules’ manufacturing process.”\nPilots can deliver these resources to the Orunmilla in the Duamta system. Aegis confirmed that the first commercially produced caustic sink launchers will be awarded to the initiative’s top contributors.\nXenological research groups have reacted positively to this development. Director Ivano Colombera of the Imperial Science Academy stated:\n“Aegis has immediately justified its reformation with this contribution to the war effort. The caustic sink launcher will allow more data on the Maelstroms to be gathered, thus furthering our understanding of the Thargoids’ capabilities.”","extractionDate":"2023-02-27T19:54:31Z","deprecated":false}