{"uid":"657ad858f56197cce7060cf3","pageIndex":0,"title":"Help Harksing’s Gifts Reach Recipients","date":"15 DEC 3309","url":"https://community.elitedangerous.com/galnet/uid/657ad858f56197cce7060cf3","content":"*Pilots’ Federation ALERT*\nThe eccentric inventor Harald Harksing has been causing quite a stir on Angel Station in the Calhuacan system.\nRecent reports suggest that the independent entrepreneur is experiencing problems with a corrupted database. This has prevented him from shipping his latest batch of inventions to their intended destinations. The commotion caused by his efforts to resolve the issue has brought both amusement and exasperation to the starport’s inhabitants.\nLishan Abara, culture correspondent for Vox Galactica, published a profile piece on Harksing:\n“Little of Harald Harksing’s background has ever been confirmed. What is well known – indeed, highly publicised – is his annual sending of unusual gifts to individuals referenced in GalNet news articles. These mostly comprise of unique toys, gadgets or games that Harksing has designed and built himself, sometimes tailor-made for the recipient.”\n“Those who receive Harksing’s inventions typically find them charming. The gourmet Giles Cappelleo, for example, was delighted by a chin-mounted palate-cleansing robot. Ambassador Delphine Dumont of the Federal Diplomatic Corps blushed when asked about the ‘Furry Yuri’ teddy bear that arrived at her office. And Archduke Otto Lombardo-Duval admitted that all twelve of his grandchildren adored a card game based on Imperial bloodlines called ‘Filial Pursuit’.”\n“Harksing himself is always overjoyed at such positive responses. He often claims to be a huge fan of each person, describing them as ‘glorious’ or ‘kings in their field’. Such boyish enthusiasm, coupled with the odd nature of his creations, has made him a local celebrity in a short time.”\n“Somewhat cynically, The Tau Ceti Journal described Harald Harksing as: ‘A calculating businessman who sends his prototypes to celebrities to secure endorsement and attract investors.’ While it is true that several manufacturers have offered contracts to mass-produce his less outlandish inventions, Harksing is more commonly viewed as a joyful and philanthropic figure.”","extractionDate":"2024-02-08T21:50:11Z","deprecated":false}