{"uid":"6514360354ea1f94560a87a4","pageIndex":0,"title":"The Future of the Throne","date":"02 OCT 3309","url":"https://community.elitedangerous.com/galnet/uid/6514360354ea1f94560a87a4","content":"The Imperial Senate has formally raised the issue that Emperor Arissa Lavigny-Duval has not yet produced any direct heirs.\nThe debate was instigated by Senator Lysandra Courcelle :\n“The continuation of the Duval bloodline has formed the linchpin of our society for over a thousand years. But it has been eight years since Arissa Lavigny-Duval became our ruler. In that time there has been no spouse or consort, no indications of marriage, and no biological heir to the throne. We politely remind the Emperor of her duty to ensure the line of succession.”\nFollowing a highly spirited exchange among senators, Chancellor Anders Blaine proclaimed:\n“Her Majesty has sacrificed much for the Empire. It is not our place to question her personal choices, but rather to support her vision for our prosperity and security.”\nGudrun Vestergaard, royal correspondent for The Imperial Herald, analysed the situation:\n“This is a delicate subject, but one of enormous importance. The Imperial Mother’s recent illness has brought into focus the passing of the torch through each generation of Duvals. Every Emperor of the last thousand years has had one or more children. The public has a certain expectation that an Emperor will produce healthy heirs to continue the Duval line, and each new birth is proudly celebrated across the Empire.”\n“However, there has never been any indication that Arissa has a partner, or entertains marriage prospects of any kind. Princess Aisling Duval’s romantic liaisons – including, famously, a Federal ambassador – took the media spotlight for years. Hadrian Duval is married with a baby son, and others such as Archduke Otto Lombardo-Duval have multiple offspring. But Her Majesty seems content to rule alone.”\n“Senator Courcelle has raised a valid question: how long can this continue? And if Arissa remains childless, who will be the next Emperor?”","extractionDate":"2023-10-28T19:26:11Z","deprecated":false}