{"uid":"65cc826f49b1d035d90bf249","pageIndex":0,"title":"Winters Pauses Inauguration After Rhea Disaster","date":"21 FEB 3310","url":"https://community.elitedangerous.com/galnet/uid/65cc826f49b1d035d90bf249","content":"President-elect Felicia Winters has delayed the start of her term of office, in response to devastating earthquakes on the planet Rhea 3.\nThe following statement was delivered by her office to a special session of Congress:\n“The terrible events on Rhea 3 have not only demanded President-elect Winters’s full attention, but also brought personal tragedy. It seems that most of the Winters family, plus many close friends, lost their lives when the capital city of New Greenacre was levelled by the earthquakes.”\n“The president-elect therefore requests permission to temporarily suspend the inauguration ceremony. This will allow her to focus on coordinating emergency operations, and also process the unexpected loss of her nearest and dearest.”\nPresident Zachary Hudson agreed to a short extension of his presidential term, thereby allowing the motion to be passed by Congress. Vice President-elect Isolde Rochester will assume leadership of the Liberal Party on an interim basis until Felicia Winters is available.\nVox Galactica published an update from local reporter Len Kennelly:\n“Rescue operations on the northern continent have intensified in recent days, as more ships and equipment arrive from across the Federation. I’m told that nearly a million survivors, albeit many injured, have now been recovered. But continual aftershocks are still toppling unstable buildings, leaving entire cities lying in dust.”\nThe Empirical scientific journal also discussed the cause of the disaster:\n“High-magnitude earthquakes are extremely rare on terraformed planets such as Rhea 3. Initial geological surveys usually detect this type of tectonic instability, to avoid establishing settlements in dangerous regions. These destructive tremors prove that despite having tamed many worlds with our technology, nature can still be unpredictable.”","extractionDate":"2025-01-28T03:38:42Z","deprecated":false}